# print("Hello, world!", 'Hi!')

# a = 5
# b = 3
# c = a * b
# print("c =", c)
# print("a + c =", a + c)
# print("a =", a)
# print("b =", b)
# if a > b:
#   print("a > b")
#   print("Hi!")
# else:
#   print("a < b")

# Написать программу для нахождения максимального из трех чисел.
# a = -20
# b = -30
# c = -4
# max = a
# if max < b:
#   max = b
# if max < c:
#   max = c
# print("max =", max)

# Со вложенными операторами
# a = 200
# b = 300
# c = 400
# if a > b:
#   if a > c:
#     print("max =", a)
#   else:
#     print("max =", c)
# else:
#   if b > c:
#     print("max =", b)
#   else:
#     print("max =", c)

# elif синтаксический сахар
# a = 200
# b = 300
# c = 400
# if a > b:
#   if a > c:
#     print("max =", a)
#   else:
#     print("max =", c)
# elif  b > c:
#  print("max =", b)
# else:
#  print("max =", c)

# Задача "Идти ли в школу?"
# is_holiday = False
# temperature = -30
# age = 15
# age_limit = 11
# temperature_limit = -27
# if is_holiday == True:
#   print("holiday")
# elif temperature >= temperature_limit:
#   print("to school")
# elif age < age_limit:
#   print("home")
# else:
#   print("to school :(")

#Задача "Друзья и бегающая между ними собака". Есть два друга, расстояние между ними 1000. Рядом с одним из друзей собака. Друзья начинаю идти навстречу друг к другу с известными скоростями (4 и 5). Собака с известной скоростью начинает бежать от одного друга навстречу ко второму, добегает до него и бежит обратно(скорость собаки 10). Вопрос - сколько раз собака перебежит от одного друга ко второму до тех пор, пока они не встретятся?
first_friend_speed = 4
second_friend_speed = 5
dog_speed = 10
distance = 1000
distance_limit = 10
dog_counter = 0
dog_direction = 1
while distance > distance_limit:
  speed = 0
  if dog_direction == 1:
    speed = first_friend_speed + dog_speed
    dog_direction = 2
  else:
    speed = second_friend_speed + dog_speed
    dog_direction = 1
  time_to_meet = distance / speed
  distance = distance - time_to_meet * (first_friend_speed + second_friend_speed)
  dog_counter = dog_counter + 1
  print("distance =", distance)
print("count =", dog_counter)
