# Написать программу для нахождения максимального из трех чисел.
a = -20
b = -30
c = -4
max = a
if max < b:
  max = b
if max < c:
  max = c
print("max =", max)
